Revit 2026 API

# PathOfTravelCreateMultiple(View, IListXYZ, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<PathOfTravel> CreateMultiple(
	View DBView,
	IList<XYZ> pathStarts,
	IList<XYZ> pathEnds
)
```
```vb
Public Shared Function CreateMultiple (
	DBView As View,
	pathStarts As IList(Of XYZ),
	pathEnds As IList(Of XYZ)
) As IList(Of PathOfTravel)
```
```cpp
public:
static IList<PathOfTravel^>^ CreateMultiple(
	View^ DBView,
	IList<XYZ^>^ pathStarts,
	IList<XYZ^>^ pathEnds
)
```
```fsharp
static member CreateMultiple :
        DBView : View *
        pathStarts : IList<XYZ> *
        pathEnds : IList<XYZ> -> IList<PathOfTravel>
```

#### Parameters

DBView View

pathStarts IListXYZ

pathEnds IListXYZ

#### Return Value

IListPathOfTravel

#### Reference

PathOfTravel Class

CreateMultiple Overload

Autodesk.Revit.DB.Analysis Namespace